export default {
  log_type: {
    1: '注册',
    2: '登录',
  },
  os_type: {
    0: '全部',
    1: 'iOS',
    2: 'Android',
    3: 'PC',
    99: '未知',
  },
  block_type: {
    1: '账号拉黑',
    2: '设备拉黑',
    3: 'IP拉黑',
  },
  ageing_type: {
    1: '拉黑7天',
    2: '永久拉黑',
    3: '自定义拉黑时间',
  },
  mute_type: {
    1: '禁言7天',
    2: '永久禁言',
    3: '自定义禁言时间',
  },
  guild_status: {
    0: '全部',
    1: '正常',
    2: '解约',
  },
  user_type: {
    1: '游客用户',
    2: '绑定手机用户',
    3: '绑定邮箱用户',
  },
  lang_type: {
    zh: '中文',
    yue: '粤语',
    en: '英语',
    vi: '越南语',
    id: '印尼语',
  },
  user_acct_status: {
    0: '全部',
    1: '正常',
    2: '已拉黑',
    3: '已禁言',
  },
  anchor_acct_status: {
    0: '全部',
    1: '正常',
    2: '已拉黑',
    3: '已注销',
  },
  recweight_status: {
    0: '全部',
    1: '已生效',
    2: '待生效',
    3: '已失效',
  },
  gift_type: {
    0: '全部',
    1: '普通礼物',
    2: '粉丝团礼物',
    3: '贵族礼物',
  }
}
