export default {
  log_type: {
    1: '注册',
    2: '登录',
  },
  os_type: {
    0: '全部',
    1: 'iOS',
    2: 'Android',
    3: 'PC',
    99: '未知',
  },
  block_type: {
    1: '账号拉黑',
    2: '设备拉黑',
    3: 'IP拉黑',
  },
  ageing_type: {
    1: '拉黑7天',
    2: '永久拉黑',
    3: '自定义拉黑时间',
  },
  mute_type: {
    1: '禁言7天',
    2: '永久禁言',
    3: '自定义禁言时间',
  },
  guild_status: {
    0: '全部',
    1: '正常',
    2: '解约',
  },
  user_type: {
    1: '游客用户',
    2: '绑定手机用户',
    3: '绑定邮箱用户',
  },
  lang_type: {
    zh: '中文',
    yue: '粤语',
    en: '英语',
    vi: '越南语',
    id: '印尼语',
  },
  user_acct_status: {
    0: '全部',
    1: '正常',
    2: '已拉黑',
    3: '已禁言',
  },
  anchor_acct_status: {
    0: '全部',
    1: '正常',
    2: '已拉黑',
    3: '已注销',
  },
  recweight_status: {
    0: '全部',
    1: '已生效',
    2: '待生效',
    3: '已失效',
  },
  gift_type: {
    0: '全部',
    1: '普通礼物',
    2: '粉丝团礼物',
    3: '贵族礼物',
  },
  push_type: {
    0: '全部',
    1: '站内信',
    2: '推送消息',
  },
  push_user_type: {
    1: '全体用户',
    2: '贵族用户',
    3: '充值用户',
    4: '自定义用户',
  },
  marquee_position: {
    0: '全部',
    1: '首页',
    2: '娱乐页',
    3: '直播间',
    4: '个人中心',
    5: '充值',
  },
  role_type: {
    0: '全部',
    1: '平台',
    2: '公会',
    3: '机构',
  },
  sms_supp_area: {
    0: '全部',
    1: '国内',
    2: '国际',
  },
  sms_chan_type: {
    0: '全部',
    1: '阿里云',
    2: '腾讯云',
    3: '网易云',
    4: '华为云',
  }
}
